{"config": [{"config": {"name": "batch_normalization_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "batch_input_shape": [null, 300, 25, 3], "dtype": "float32", "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "conv2d_1", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "strides": [2, 1], "activation": "relu", "padding": "same", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "conv2d_2", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activation": "relu", "padding": "same", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_3", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "strides": [2, 1], "activation": "relu", "padding": "same", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_4", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "conv2d_4", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activation": "relu", "padding": "same", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_5", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "conv2d_5", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "strides": [2, 1], "activation": "relu", "padding": "same", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_6", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_6", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activation": "relu", "padding": "same", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_7", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "conv2d_7", "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "strides": [2, 1], "activation": "relu", "padding": "same", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_8", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling2d_3", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_regularizer": {"config": {"l2": 1.9999999494757503e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "units": 128, "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "batch_normalization_9", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "dense_2", "kernel_regularizer": {"config": {"l2": 1.9999999494757503e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "units": 64, "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "batch_normalization_10", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "dense_3", "kernel_regularizer": {"config": {"l2": 1.9999999494757503e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "units": 49, "activation": "softmax", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.4"}